ABS implementation
